Спортклуб/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
</mdclass:Document>

Спортклуб/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Спортклуб/src/Documents/ПродажаТовара/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбщаяСумма = Товар.Итог("Сумма");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаТовараТовар.Товар КАК Товар,
		|	СУММА(ПродажаТовараТовар.Количество) КАК Количество,
		|	ПродажаТовараТовар.Сумма
		|ПОМЕСТИТЬ ВТДокумента
		|ИЗ
		|	Документ.ПродажаТовара.Товар КАК ПродажаТовараТовар
		|ГДЕ
		|	ПродажаТовараТовар.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараТовар.Товар,
		|	ПродажаТовараТовар.Сумма
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОстатки.Товар,
		|	ТоварыОстатки.КоличествоОстаток,
		|	ТоварыОстатки.СуммаОстаток
		|ПОМЕСТИТЬ ВТОстаткиТовара
		|ИЗ
		|	РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
		|ГДЕ
		|	ТоварыОстатки.Товар В
		|		(ВЫБРАТЬ
		|			ВТДокумента.Товар
		|		ИЗ
		|			ВТДокумента КАК ВТДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокумента.Товар,
		|	ВТДокумента.Количество,
		|	ЕСТЬNULL(ВТОстаткиТовара.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВТОстаткиТовара.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВТДокумента.Сумма КАК Сумма
		|ИЗ
		|	ВТДокумента КАК ВТДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиТовара КАК ВТОстаткиТовара
		|		ПО ВТДокумента.Товар = ВТОстаткиТовара.Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество = ВыборкаДетальныеЗаписи.Количество;
		ОстатокТовара = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Если Количество > ОстатокТовара Тогда
			ВызватьИсключение("Вы не можете продать товар в таком количества. Остаток товара на складе:" + ВыборкаДетальныеЗаписи.КоличествоОстаток)
		Иначе 
			Движения.Товары.Записывать = Истина;
			Движение = Движения.Товары.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
